Диплом/src/Documents/ВКМ_ОбслуживаниеКлиента/ВКМ_ОбслуживаниеКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ОбслуживаниеКлиента</name>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеКлиентуРаботы</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеСотрудникомРаботы</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Специалист</name>
    <type>
      <types>CatalogRef.ВКМ_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроведенияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНачалаРаботПлан</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОкончанияРаботПлан</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеПроблемы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ВыполненныеРаботы</name>
    <attributes>
      <name>ОписаниеРабот</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФактическиПотраченныеЧасы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧасыКОплатеКлиенту</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Диплом/src/Documents/ВКМ_ОбслуживаниеКлиента/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
   // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
Если Не ЗначениеЗаполнено(Объект.Дата) тогда
	ЭтоПерваяЗапись = Истина;
КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	 // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры



&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	  ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ЭтоПерваяЗапись = Истина Тогда
	Уведомление = Справочники.ВКМ_УведомленияБоту.СоздатьЭлемент();
    Уведомление.ТекстСообщения = "Закаказ №"+Объект.Номер + " от " + Формат(Объект.Дата, "ДФ=dd.MM.yyyy") 
    + ", исполитель " + Объект.Специалист + ", дата проведения работ " 
    + Формат(Объект.ДатаПроведенияРабот, "ДФ=dd.MM.yyyy") + " "
    + Формат(Объект.ВремяНачалаРаботПлан,"ДЛФ=T;")  + ", проблема - " + Объект.ОписаниеПроблемы;
    Уведомление.Записать();
	Иначе
		Если ЗначениеЗаполнено(ТекстИзменения) тогда
	     Уведомление = Справочники.ВКМ_УведомленияБоту.СоздатьЭлемент();
    Уведомление.ТекстСообщения = "В закаказе №"+Объект.Номер + " от " + Формат(Объект.Дата, "ДФ=dd.MM.yyyy") 
    + " произошли изменения. " + ТекстИзменения;
    Уведомление.Записать();
         КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти


&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	НужноОтправитьУведомление=Истина;
КонецПроцедуры

&НаКлиенте
Процедура СпециалистПриИзменении(Элемент)
	Если ЭтоПерваяЗапись = Ложь тогда
	ТекстИзменения = ТекстИзменения + "Изменился исполнитель " + Объект.Специалист + " "; 
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДатаПроведенияРаботПриИзменении(Элемент)
	Если ЭтоПерваяЗапись = Ложь тогда
	ТекстИзменения = ТекстИзменения + 
	"Изменилась дата проведения работ " + Формат(Объект.ДатаПроведенияРабот, "ДФ=dd.MM.yyyy") + " ";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВремяНачалаРаботПланПриИзменении(Элемент)
	Если ЭтоПерваяЗапись = Ложь тогда
	ТекстИзменения = ТекстИзменения + 
	"Изменилось время начала работ " + Формат(Объект.ВремяНачалаРаботПлан,"ДЛФ=T") + " ";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВремяОкончанияРаботПланПриИзменении(Элемент)
	Если ЭтоПерваяЗапись = Ложь тогда
	ТекстИзменения = ТекстИзменения + 
	"Изменилось время окончания работ " + Формат(Объект.ВремяОкончанияРаботПлан,"ДЛФ=T") + " " ;
	КонецЕсли;
КонецПроцедуры
#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры
&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды


#КонецОбласти
